{
  "_num_labels": 2,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "None",
    "1": "body",
    "2": "culture",
    "3": "disabled",
    "4": "gender",
    "5": "race",
    "6": "social",
    "7": "victim"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "None": 0,
    "body": 1,
    "culture": 2,
    "disabled": 3,
    "gender": 4,
    "race": 5,
    "social": 6,
    "victim": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.53.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
